case/channel_460k_cells/system/decomposeParDict
/*-------------------------------*- C++ -*---------------------------------*\
|    =========                                                              |
|    \\      /     OpenFOAM                                                 |
|     \\    /                                                               |
|      \\  /       The Open Source CFD Toolbox                              |
|       \\/                                        http://www.OpenFOAM.org  |
\*-------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    note        "mesh decomposition control dictionary";
    location    "system";
    object      decomposeParDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains  24;

 method          simple;

simpleCoeffs
{
    n           (2 3 4);
    delta       0.001;
}

hierarchicalCoeffs
{
    n           (1 2 2);
    delta       0.001;
    order       xyz;
}


manualCoeffs
{
    dataFile    "";
}

distributed no;

roots ();

// ************************************************************************* //
